# Python - არის ყველაზე მარტივარ შესაწავლი ენა რომელიც გამოიყენება როგორც front-end ისე back-end-ში

#---------------------------------------------------------------------------------------------------------------------------------------------------




# Data types in python 

# პითონში გვაქვს 4 ძირითადი მონაცემის ტიპი


# string - მონაცემი რომელიც მოქცეულია ბრჭყალებში (" ",  ' ') - (მაგ: 'Gvanca' "12")

# integer - მთელი რიცხვები (მაგ: 12, 15, 30...

# float - წილადური რიცხვები (მაგ: 12.3, 12.7)

# boolean - აქვს ორი მნიშვნელობა True და False - მისი პირველი ასოები აუცილებლად იწერება დიდი ასოებით 




#---------------------------------------------------------------------------------------------------------------------------------------------------




# comments  - კომენტარები


# --> hash symbol - იგივე ძიეზი რომლითაც ვწერთ კომენტარს 
#  კომენტარი -  სუტყვათ ერთობლიობა რომელსაც კომბიუტერი აიგნირებს იმ სიკბოლის გამოყენებით რომელიც განსაზღვრულია ენისათვოს, კომენტარი არსებობს მხოლოდ ადამიანისთვის


#---------------------------------------------------------------------------------------------------------------------------------------------------



# print() -  ფუნქცია რომლის საშვალებით გამოგვაქვს ჩვენი კოდის შედეგი

# მაგ: 
print(45)




#---------------------------------------------------------------------------------------------------------------------------------------------------




# Variables – ცვლადები 

# variable - ცვლადი, სახელი რომელშიც ინახება რაიმე მონაცემის ტიპი. სასურველია თუ ცვლადის სახელი იქნება მისი მნიშვნელობის შესაბამისი

# სიტყვისთვის მნიშვნელობის მიცემა ხდება "=" ტოლობის ნიშნით 

name = 'Gvanca'
# ცვლადი სახელი - name 
# მისი მნიშვნელობა - Gvanca

# Declaration - დეკლარაცია, ცვლადის შექმნა 
age = 15

# Redeclaration - რიდეკლარაცია, ცვლადისთვის ახალი მნიშვნელობის მიცემა. ეს ხდება მაშინ როდესაც ორი ერთნაირი ცვლადი ხვდება ერთმანეთს და ხდება ცვლადის მნიშვნელობის გადაწერა

age = 19



#---------------------------------------------------------------------------------------------------------------------------------------------------



# concatenatioin - კონკატინაცია, string-ის მონაცემის დამატება string-ზე

print('Gvanca ' + 'Mazanishvili')


#---------------------------------------------------------------------------------------------------------------------------------------------------


# Mathematical operations -  მათემატიკური ოპერატორები 

# + --> მიმატება 
print(18 + 82)

# - --> გამოკლება 
print(18 - 82)

# * --> გამრავლება 
print(18 * 82)

# ** --> ახარისხება
print(18 ** 82)

# / --> ნაშთიანი გაყოფა 
print(18 / 82)

# // --> უნაშთო გაყოფა
print(18 // 82)

# % --> Remainder უნაშთო გაყოფა 
print(18 % 82)



# ჩვენ string მონაცემზე შეგვიძლია მხოლოდ გამრავლების გამოყენება 


#---------------------------------------------------------------------------------------------------------------------------------------------------


# Debuggin ---> Errors

# debugging --> არის კოდში არსებული შეცდომების პოვნა და მათი გასწორება. შეცდომებს კი Bug ან Error-ით მოიხსენიებენ 




#---------------------------------------------------------------------------------------------------------------------------------------------------


# Input and Output 

# Input --> როდესაც ინფორმაცია შედის შიგნით ამას ეწოდება input მაგ: ღილაკის დაჭერა

# Output --> როდესაც მონაცემი გადის რაიმე მოწყობილობიდან ამას ეწოდება output, მაგ: დინამიკიდან ხმის გამოსვლა

#  ის აუცილებლად უნდა შევინახოთ ცვლადში 
# მაგ:

name = input("Enter your name: ")



#---------------------------------------------------------------------------------------------------------------------------------------------------


# Data type Checking - მონაცემთა ტიპების შემოწმება 

# მონაცემების შესამოწმებლად ვიყენებთ მეთოდს --> type(), მასში ჩაწერილ არგუმენტს შეამოწმებს და დააბრუნებს შესაბამის მონაცემის ტიპის სახელს

# მაგ:
print(type("GOA")) # <class 'str'>



#---------------------------------------------------------------------------------------------------------------------------------------------------


# Data type conversion - მონაცემის ტიპის გარდაქმნა 

# str() --> ფრჩხილებში გადაცემ არგუმნეტს გარდაქმნის string-ად 
# მაგ:
print(str(27)) # "27"

# int() --> ფრჩხილებში გადაცემ არგუმნეტს გარდაქმნის integer-ად 
# მაგ:
print(int("27")) # 27

# float() --> ფრჩხილებში გადაცემ არგუმნეტს გარდაქმნის float-ად
# მაგ: 
print(float(28)) # 28.0

# bool() --> ფრჩხილებში გადაცემ არგუმნეტს გარდაქმნის boolean-ად
# მაგ:
print(bool(2 > 8)) # False
print(bool(2 < 8)) # True


# ეს ფუნქციები არიან explicit-ის მაგალიტები 




#---------------------------------------------------------------------------------------------------------------------------------------------------



# f" " - F"" ---> f string

# f string --> საშვალებას გვაძლევს რომ სხვადასხვა მონაცემის ტიპი დავწეროთ ერთ ხაზზში
# მაგ:

name = "gvanca"
surname = 'mazanishvili'
age = 15
height = 165

print(f"hello, my name is {name}, my surname is {surname} i am {age} years old and i am {height}cm tall")

# {} --> ფიგურულ ფრჩხილებში ვწერთ იმ ცვლადის სახელს რომლის ჩასმაც ჩვენ გვინდა. ზემოთ არსებული კოდის შედეგი იქნება ასეთი:
# 
#  hello, my name is gvanca, my surname is mazanishvili i am 15 years old and i am 165cm tall




#---------------------------------------------------------------------------------------------------------------------------------------------------


# comparasion operations  - შედარების ოპერატორები 

# > --> მეტია
# < --> ნაკლებია 
# >= --> მეტია ან ტოლია 
# <= --> ნაკლებია ან ტოლია
# != --> არ უდრის
# == --> უდრის უდრის, როდესაცვადარებთ ერთ მონაცემს მეორესთან და ვარკვევთ ერთნაირია თუ არა

# შედარების ოპერატორები აბრუნებენ ყოველთვის boolean მნიშვნელობას 






#---------------------------------------------------------------------------------------------------------------------------------------------------


# Logical operations - ლოგიკური ოპერატორები 

# and - და
# or - ან

# ლოგიკური ოპერატორებიც აბრუნებენ boolean მნიშვნელობებს 

# and - ოპერატორის გამოყენების დროს პრიორიტეტი ეძლევა False მნიშვნელობას

# or - ოპერატორის გამოყენების დროს პრიორიტეტი ეძლევა  True მნიშვნელობას


True and True # True
True and False # False
False and True # False
False and False # False


True or True # True
True or False # True
False or True # True
False or False # False





#---------------------------------------------------------------------------------------------------------------------------------------------------



# Control Flow - დინების კონტროლი

# თანმიმდევრობით კოდის გაშვება რომლიც ინსტრუქციებზე დაყრდნობით ხდება 


# Control flow არის სამი სახის: sequencing, interations, selections.


# sequencing --> კოდის თანმიმდევრობით გაშვებას ზემოდან ქვემოთ

num = 19
print(num)

# interations --> კოდის ხელმეორედ გამეორება 

for i in range(0, 10, 1):
    print(i)

# selections -->  კოდში არჩევანის გაკეთება 

temperature = 15

if temperature > 20:
    print("ცხელა არის")
else:
    print("ცივა არის")




# For loop - ციკლი რომლის დროსაც ჩვენ ვიცით კონნრეტული ინტერაცია

for i in range(0, 20, 2):
    print(i)

# for - for loop keyword
# i - საინტერაციო ცვლადი
# in - ში; 
# range() - დიაპაზონი, ის კონკრეტული არეალი რომლის ფარგლებშიც ვაწარმოებთ კოდს 
# 0 --> start საიდანაც იწყება ათვლა 
# 20 --> სადამდეც იქნება გაშევული კოდი. იმ რიცხვს რომელსაც ჩვენ დავწერთ 
# 2 --> step ის ნაბიჯები რომლის გამოტოვებითაც დაიწყებს კოდი გაშვებას 

# თუ გვინდა რომ ციკლმა კლებადობით დაიწყო თვლა ამისთვის step-ში დავუწერთ მინუსს წინ 


# for loop-ით შეგვიძლია გადავუაროთ --> string-ებს და arrays - list - სიებს 






# while loop - ციკლი რომლის დროსაც არ ვიცით ზუსტი ინტერაცია 

# მანამდე გაეშვება კოდი საბან მისი მნიშნელობა არ იქნება True-ს ტოლი

seats  = 10 # counter variable - დათვლის ცვლადი
while seats > 0:
    print ("Sell ticket")

    seats = seats - 1 # ყოველი ინტერაციის შემდეგ ადგილებს დააკლდებათ 

# while - loop-ს keyword 
# seats > 0 --> პირობა რომელსაც მიყვება ციკლის ტანი 






#---------------------------------------------------------------------------------------------------------------------------------------------------




# Conditional statements  -  პირობითი განცხადედები 

# პირობითი განცხადებებს ვიყენებთ მაშინ როდესაც ჩვენ მრავალი შემოწმება გვჭირდება 

age  = int(input("Enter yout age: "))

if age < 5:
    print("You are a toddler")
elif age > 5 and age < 15:
    print("You are a teen")
else:
    print('You are Adult')


# if  - თუ, ის მხოლოდ იწერება თავში პირველი შემოწმებები 

# elif - else if --> ის შეგვიძლია გამოვიყენოთ რამდენი შემოწმებაც დასჭირდება კოდს, და შეილება გადათარგმნეს ორგორც სხვა თუ

# else - სხვა შემთხვევაში, მას არანაირი პირობა არ ეწერება და გამოაქვს მხოლოდ 



# break - აჩერებს ინტერაციებს
# continue - აგრძელებინებს ინტერაციას





#---------------------------------------------------------------------------------------------------------------------------------------------------






# Array - list --> მასივები, სიები


# list - სია არის მონაცემის ისეთი სტრუქტურა რომელშიც ინახება სხვადასხვა მონაცემის ტიპენი. ის იწარმოება ცვლადის დასახელებისა და [] - კვადრატული ფრჩხილებისგან

# სიაში შეგვიძლია შევინახოთ სხვადასხვა მონაცემის ტიპები ერთდროულად 

# list --> არის mutable, რაც ნიშნავს რომ მასში შეგვიძლია ჩავუმატოთ, წავშალოთ ელემენტები
# მაგ:

random = ["apple", 'pear', 12, 29, 28.2, True, False]

# random - სიის სახელი 

# ["apple", 'pear', 12, 29, 28.2, True, False] - სიაში მოქცეული ელემენტები რომლებიც გამოიყოფა მძიმეებით

# print() - ის გამოყენებით ჩვენ შეგვიძლია დავბეჭდოთ სიის ელემნტები 
print(random)





# indexing  - ინდექსინგი 

# სიებში კომპიტერი ელემენტერბს ხედავს სხვა გვარად,  ის ელემეტების ათვლას იწყებს 0-დან ამიტომაც თუ სიაში გვაქვს 5 ელემენტი, მისი ინდექსების რაოდენობა  იქნება 4

#            0        1     2   3    4     5     6
random = ["apple", 'pear', 12, 29, 28.2, True, False]

print(random[3]) # 12
# იმისთვის რომ ცალკეული ელემნტი დავბეჭდოთ ტერმინალში ამისთვის ვიყენებთ ჩვენ სიის ცვლადს, [] - კვადრატულ ფრჩხილებს და იმ ინდექსს რომლის დაბეჭვდაც გვინდა 

# თუ გვინდა რომ სიის მონაცემის ბოლო ელემენტი შეგვიძლია გამოვიყენოს -1
print(random[-1]) # False


# string - არის სიმბოლოეაბის თანმიმდევრობა
# list - არის ელემენტების თანმიმდევრობა 




# slicing - ჩამოჭრა 

# მის დახმარებით ჩვენ შეგვიძლია სიიდან რაღცა მოკლე ნაწილი ამოვიღოთ, ამოვჭრათ.
# დაწყების და დასრულების ინდექსები გამოყოფილია ორწერტილით:  როგორც for loop-ის დროს, არის start, end, step. დასასრულის ინექსი არ ითვლება 
# მაგ:
animals =["cat", "dog", "bird", "cow"]
print(animals[1:3]) # ['dog', 'bird']


# string slicing 

text = 'Hello World'
print(text[0:5])  # Hello



#---------------------------------------------------------------------------------------------------------------------------------------------------




# Functions - ფუნქციები

# ფუნქციები არიან მრავალჯერად გამოყენების კოდის ბლოკი რომელსაც კონკრეტული დავალება აკისრია მხოლოდ 


# calling a function - ფუნქციის გამოძახება 

# იმისთვის რომ ჩვენ ჩვენი კოდი გამოვაჩინოთ ამისთვის ჩვენ უნდა გამოვიძახოთ ის მისი სახელით და ფრჩხილებით
# მაგ:
print() # print() - არის ერთ ერთი მრავალ გამოყენებადი ფუნქცია რომლის ერთადერთი დავალებაა რომ გამოიტანოს ის ტერმინალში

# () - ფრჩხილებში გადაცემულ მნიშვნელობას არგუმენტი ეწოდება, შეგვუძლია ერთ ფუნქციაში მრავალი არგუმენტი დავწეროთ, მაგრამ ის უნდა იყოს გამოყოფილი მძიმით 



# print(), range(), input(), int(), str(), float(), bool()  --> ასეთი ტიპის ფუნქციებს უწოდებენ ჩაშენებულ ფუნქციებს, რომლებსაც visual studio გვთავაზობს 






# list methods  - სიის მეთოდები  

# .append() - ამატებს ელემენტს ბოლოში
# .insert() - ამატებს ელემენტს კონკრეტულ ადგილას, ის იღებს ორ არგუმენტს: პირველი სადაც გვინდა რომ ჩავსვათ ინდექსით და მეორე თუ რა უნდა ჩავსვათ 
# .pop() - შლის ელემენტს დაფიქსირებული ინდექსით 
# .clear()  - აშორებს ყველას ელემტს სიიდან 
# .count() - დააბრუნებს რიცხვს თუ რამდენი შეხვდა რაღც კომკრეტული მნიშვნელობა
# .index() - აბრუნებს პირველ შემხვედრ ინდექს რომელსზეც დგას ეს ელემნტი. ის იღებს მხოლოდ ერთ ერგუმენს
# .remove() - აშორებს მითითებულ მნიშვნელობას 
# .reverse() - არტიალებს მთლიან სიას 
# .sort() - ალაგებს სიას ზრდადობით
# .len() - აბრუნებს სიის სიგრძეს, რამდენი ელემენტია შიგნით 


# string methods - სტრინგის მეთოდები 

# .upper() - გადაჰყავს დიდ ასოებში
# .lower() - გადაჰყავს პატარა ასოებში
# .capitalize() - პირველი ასო დიდი, დანარჩენი პატარა
# .strip() - შლის სივრცეებს ორივე მხრიდან
# .split() - ყოფს სტრინგს სიად
# .find() - მეთოდი პოულობს მითითებული მნიშვნელობის პირველ შემთხვევას. მეთოდი აბრუნებს -1-ს, თუ მნიშვნელობა ვერ მოიძებნა.
# .join() - აერთიანებს სიის ელემენტებს სტრინგად
# .startswith() - ამოწმებს იწყება თუ არა კონკრეტული ტექსტით
# .endswith() - ამოწმებს მთავრდება თუ არა კონკრეტული ტექსტით
# .isdigit() - ამოწმებს არის თუ არა მხოლოდ ციფრები
# .isalpha() - ამოწმებს არის თუ არა მხოლოდ ასოები
# .isupper() - ამოწმებს არის თუ არა დიდ ასოებში
# .len() - აბრუნებს სიის სიგრძეს, რამდენი ელემენტია შიგნით 



# Custom functions - სპეციალური ფუნქციები 

# ზოგჯერ ჩაშენებუბლი ფუნქციები არ გვყოფნის ამიტომაც გვჭირდება ჩვენითვე შევქმნათ ფუნქციები.
# ამისთვის ჩვენ ვიყენებთ keyword - Def, 
# მას მოყვება ფუნქციი სახელი და ფრჩხილები,
# რომელშიც ჩაიწერება პარამეტრი ---> მონაცემი რომელიც შემდგომ უნდა გადავცეთ. ამის შემდეგ კი ვწერთ ფუნქციის ტანს.

# მაგ:

def greet(name):
    print(f"hello {name}")


greet('gvanca') # hello gvanca

# name - არის პარამეტრი რომელსაც შემდეგ გადაეცემა არგუმენტი, ასევე შეგვიძლია ერთზე მეტი პარამეტრიც მივუწეროთ 

# Return  - დაბრუნება 

# print() ფუნცია ჩვენ კოდს პირდაპირ გვაიბრუნებს ტერმინალში, ხოლო return-ის გამოყენებით ჩვენ ფუნქციაშივე ვაბრუნებთ პასუბს.
# მაგ:

def add(a, b):
    return a + b

print(add(3, 4)) # 7