installing tools - გადმოსაწერი ხელსაწყოები 

// https://www.youtube.com/watch?v=ZVGutgqBMUM&t=103s --> Youtube link

// 1) Extentions: C# and C# Dev Kit
// 2) უნდა გავხსნათ ექაუნთი michrosoft-ის
// 3) .NET SDk გვჭირდება იმისთვის რომ ავაშენოთ და ავაგოთ ჩვენი კოდი
    // dotnet --info --> გვიჩვენებს გადმოწერილი .NET-ის უნფორმაციას
// 4) იმისთირ რომ შეცქმნათ პროეტი ცარიელი visual studio უნდა გავხსნათ და შევქმნათ პროექტი 




What is C#? 

// C# გავს Java-ს, ორივე მათგანი ხშირად გამოყენებადი პროგრამირების ენაა


რისი გაკეთბა შეგვიძლია C#?

// 1) ინტერაქტიული ვებსაიტების 
// 2) მობილური თამაშების 
// 3) ვიდეო თამაშების
// 4) დესქდიპ აპლიკაციების 