// React.js --> არის JavaScript-ის ერთ ერთი ბიბლიოთკა, რომელიც არის მოთხოვნადი კომპანიებს შორის


// react --> არის უფასო და ხელმისაწვდომი ბიბლიოთეკა რომელიც ეხმარება მომხმარებელს სამუშაო გარემოს გაუმჯობესებაში


// დადებითი თვისებები

/* 
1. უამრავი ადამიანი იყენებს და არის მოთხოვნადი. არსებობს ბევრი რესურსი და სამომხმარებლო წრე.

2. ის შექმნილია meta კომპანიის მიერ რომელსაც აქვს instagram, facebook, whatsapp... facebook-ი შექმნილია reaxt-ის საშვალებით ამიტომ მისი განახლება ხდება ყოველდღიურად.

3. ის იყენებს SPA --> single page applications - მეთოდს რომ საიტი იყოს გაცილებით სწრაფი. react-ის გამოყენებისას იქმნება ერთი დიდი ფაილი, რომელიც იყენებს გაქრობა გამოჩენის თვისებას რომ ერთი გაშვებით საიტის ყველა გვერდი ჩაიტვირთოს, რომ სხვადასხვა გვერძე გადასვლისას არ დასჭირდეს ცალ-ცალკე დოკუმენტების (html-ის ფაილის) მოთხოვნა 

4. მისი სინტაქსი არის მარტივი შესასწავლი 
*/




// --------------------------------------------------------------------------------------------------------------------------------------------------





// How to install React? 
// იმითვის რომ react-ი გამოვიყენოთ უნდა გადმოვწეროთ 



// --------------------------------------------------------------------------------------------------------------------------------------------------





// JSX 

// jsx ---> არის სინტაქსური გაფართოება javaScript-ისთვის. ის შეიქმნა იმისთვის ტომ გამოიყყენებოდეს react-ის დროს.

// სინტაქსური გაფართოება ნიშნავს იმას რომ browser-ი ვერ წაიკითხავს მას და საჭირა მისი JavaScript-ის ენაზე გადათრგმნა სანამ მას browser-ში გავუშვათ 




// --------------------------------------------------------------------------------------------------------------------------------------------------




// jsx elements - jsx ელემენტები 

// ელმენტების შენახვა ჩვენ შეგვიძლია ცვლადებში, გადავცეთ ფუნქციას, შევინახოთ object-ში, ან მასივში 

// მაგ:
const navBar = <nav>I am a nav bar</nav>;


const myTeam = {
    center: <li>Benzo Walli</li>,
    powerForward: <li>Rasha Loa</li>,
    smallForward: <li>Tayshaun Dasmoto</li>,
    shootingGuard: <li>Colmar Cumberbatch</li>,
    pointGuard: <li>Femi Billon</li>
};


// ელემენტების შექმნისას უნდა დავამთავროთ აუცილებლათ ";" ---> წერტილმძიმით, სხვა შემთხვევაში კი გამოგვიტანს Error-ს



// --------------------------------------------------------------------------------------------------------------------------------------------------




// Attributes In JSX - ატრიბუტები jsx-ში 

// ჩვენ შეგვიძლია ატრიბუტები გავუწეროთ jsx ელემენტებს როგორც html-ის ელემენტებს 

// name = "value"




// --------------------------------------------------------------------------------------------------------------------------------------------------




// nesting in JSX 

// ჩვენ შეგვიძლია ჩავაშენით ბევრი გამოსახულებები. თუ კი ის ბევრ ხაზს იკავებს ის უნდა ჩავსვათ () --> ფრჩხილებში 

(
    <a href="https://www.example.com">
        <h1>
            Click me!
        </h1>
    </a>  
)




// --------------------------------------------------------------------------------------------------------------------------------------------------




// The Outer elements -- გარე ელემენტები 

// JSX-ში როდესაც ვიყენებთ ბევრ კოდს და მას ვუტოლებთ რაღაც კონსტანტას, მას აუცილებლად უნდა ჰქონდეს მშობელი ელემნეტი 

const paragraphs = (
    <div id="i-am-the-outermost-element">
        <p>I am a paragraph.</p>
        <p>I, too, am a paragraph.</p>
    </div>
);
