
# python compiler --> კითხულობს კოდს ზემოდან ქვემოთ ამიტომაც ბოლო ცვლადი რომელიც შეხვდება რიდეკლარაციის შემდეგ იქნება მისი საბოლოო მნიშვნელობა 



#---------------------------------------------------------------------------------------------------------------------------------------------------



# high-level and low-level

# high-level --> ისეთიი ენა რომელიც არის ახლოს ადამიანის ენასთან
# low-level --> ისეთი ენა რომელიც ახლოს არის კომპიტერის ენასთან



#---------------------------------------------------------------------------------------------------------------------------------------------------


# cpu - კომპიუტერი ტვინი, რომლიც ასრულებს ყველანაირ ოპერაციას 


#---------------------------------------------------------------------------------------------------------------------------------------------------


# Algorhithm --> ალგორითმი, არის იგივე ინსტრუქციები რომელსაც კომპიუტერი მიყვება თანმიმდევრობით



#---------------------------------------------------------------------------------------------------------------------------------------------------


# natural language --> კომპიუტერი უნდარი წაიკითხოს ადამიანის ენა 



#---------------------------------------------------------------------------------------------------------------------------------------------------



# pseducode --> გამარტივებული ენა რომლიც არის ახლოს კომპიტერუს ენასთან 


#---------------------------------------------------------------------------------------------------------------------------------------------------


# implicit --> როდესაც კომპიტერს ავტომატურად გადააქვს მონაცემის ტიპი სხვა მონაცემის ტიპად 
# explicit --> როდესაც ჩვენთვითონ გადაგაქვს მონაცემის ტიპი სხვა მონაცემის ტიპად 



#---------------------------------------------------------------------------------------------------------------------------------------------------


# flow-chart --> არის ალგორითმის ტიპი რომელიც წარმოადგენს მუშაობის პროცესს

