// DOM - document object model

// DOM -ი არის გზა რომ html-თან გვქონდეს წვდომა მარტივად. ის გვეხმარება რომ ურთიერთიბა გვქონდეს html-თან

console.dir(document) // გამოაქვს html-ის ყველა ელემენტი object-ების სახით 


// document - ეს არის html ფაილის ტიპი რასაც ჩვენი live server-ი არენდერებს

// --------------------------------------------------------------------------------------------------------------------------------------------------




// როგორ მივწვდეთ ელემენტებს ?

// ჩვენ შეგვიძლია ელემენტებს მივწვდეთ html-ში მეთოდების გამოყენებით. არსებობს სხვადასხვა გვარის:

// 1. document.getElementById('Id name') --> ჩვენ შეგვიძლია ამ მეთოდით html-ის id-ის მივწვდეთ 
// 2. document.getElementsByClass('Class name') --> ჩვენ შეგვიძლია ამ მეთოდით html-ის class-ებს მივწვდეთ 
// 3. document.getElementByTagName('tag name') --> ჩვენ შეგვიძლია ამ მეთოდით html-ის ნებისმიერ თეგს მივწვდეთ
// 4. document.getElementsByName('names mnishvneloba') --> ჩვენ შეგვიძლია name ატრიბუტის მქონე ელემენტს მივწვდეთ და გამოვიტანოთ ისინი node list-ის სახით 
// 5. document.querySelector('element id') --> ჩვენ ამ მეთპდით შეგვიძლია მხოლოდ ერთ ელემენტს მივწვდეთ და მისი სინტაქსით თუ id-ის ვწვდებით სახელს სინ ვუწერთ "#" ნიშანს
// 6. document.querySelectorAll('elementi') --> პოულობს ყველა იმ ელემენტს რომლებიც არიან ამ სახელით, კლასის შემთხვევაში სახელს წინ ვუწერთ "."






// --------------------------------------------------------------------------------------------------------------------------------------------------




// როგორ შევუცვალოთ მნიშვნელობა ელმენტებს?

// იმისთის რომ მივწვდეთ ელემენტებს და მათ შევუცვალოთ რაიმე ამისთვის ვიყენებთ dot notation

// მაგ:
let text = document.getElementById('name').textContent = "Gvanca" // შევუცვალეთ ტექსტურ მნიშვნელობა გვანცათი

// ამ გვარად შეგვიძლია შევუცვალოთ class-ის სახელი, style-სტილი

// სტილიში შეიძლება შედიოდეს: top, left, width, height, color და ყველა გამოიძახება დოტ ნოტაციით 

// js-ში ჩვენ ვწერთ camelCase-ის რაც ნიშნავს რომ ორ სიტყვიანი css კუთვნილებებიც javaScript-ში დაიწერება როგორც camelCase
// მაგ: -->  backgroundColor: green ;






// --------------------------------------------------------------------------------------------------------------------------------------------------



// Changing Style - სტილის შეცვლა

// ჩვენ ელემენტებთან წვდომით შეგვიზლია შევცვალოთ სტილი
// ელემენტის შეცვლისას ვიყენებთ თანმიმდევრობას 
// მაგალითად თუ მინდა რომ ტექსტის ზომა შეცვალო ასე დავწერთ:

let btn = document.getElementById("myButton");
btn.style.color= "yellow";

// იგივე იქნება backgroundColor, width, height...


