// DOM - document object model

// DOM -ი არის გზა რომ html-თან გვქონდეს წვდომა მარტივად. ის გვეხმარება რომ ურთიერთიბა გვქონდეს html-თან

console.dir(document) // გამოაქვს html-ის ყველა ელემენტი object-ების სახით 


// document - ეს არის html ფაილის ტიპი რასაც ჩვენი live server-ი არენდერებს

// --------------------------------------------------------------------------------------------------------------------------------------------------




// როგორ მივწვდეთ ელემენტებს ?

// ჩვენ შეგვიძლია ელემენტებს მივწვდეთ html-ში მეთოდების გამოყენებით. არსებობს სხვადასხვა გვარის:

// 1. document.getElementById('Id name') --> ჩვენ შეგვიძლია ამ მეთოდით html-ის id-ის მივწვდეთ 

// 2. document.getElementsByClass('Class name') --> ჩვენ შეგვიძლია ამ მეთოდით html-ის class-ებს მივწვდეთ 

// 3. document.getElementByTagName('tag name') --> ჩვენ შეგვიძლია ამ მეთოდით html-ის ნებისმიერ თეგს მივწვდეთ

// 4. document.getElementsByName('names mnishvneloba') --> ჩვენ შეგვიძლია name ატრიბუტის მქონე ელემენტს მივწვდეთ და გამოვიტანოთ ისინი node list-ის სახით 

// 5. document.querySelector('element id') --> ჩვენ ამ მეთპდით შეგვიძლია მხოლოდ ერთ ელემენტს მივწვდეთ და მისი სინტაქსით თუ id-ის ვწვდებით სახელს სინ ვუწერთ "#" ნიშანს

// 6. document.querySelectorAll('elementi') --> პოულობს ყველა იმ ელემენტს რომლებიც არიან ამ სახელით, კლასის შემთხვევაში სახელს წინ ვუწერთ "."






// --------------------------------------------------------------------------------------------------------------------------------------------------




// როგორ შევუცვალოთ მნიშვნელობა ელმენტებს?

// იმისთის რომ მივწვდეთ ელემენტებს და მათ შევუცვალოთ რაიმე ამისთვის ვიყენებთ dot notation

// მაგ:
let text = document.getElementById('name').textContent = "Gvanca" // შევუცვალეთ ტექსტურ მნიშვნელობა გვანცათი

// ამ გვარად შეგვიძლია შევუცვალოთ class-ის სახელი, style-სტილი

// სტილიში შეიძლება შედიოდეს: top, left, width, height, color და ყველა გამოიძახება დოტ ნოტაციით 

// js-ში ჩვენ ვწერთ camelCase-ის რაც ნიშნავს რომ ორ სიტყვიანი css კუთვნილებებიც javaScript-ში დაიწერება როგორც camelCase
// მაგ: -->  backgroundColor: green ;






// --------------------------------------------------------------------------------------------------------------------------------------------------



// Changing Style - სტილის შეცვლა

// ჩვენ ელემენტებთან წვდომით შეგვიზლია შევცვალოთ სტილი
// ელემენტის შეცვლისას ვიყენებთ თანმიმდევრობას 
// მაგალითად თუ მინდა რომ ტექსტის ზომა შეცვალო ასე დავწერთ:

let btn = document.getElementById("myButton");
btn.style.color= "yellow";

// იგივე იქნება backgroundColor, width, height...






// --------------------------------------------------------------------------------------------------------------------------------------------------





// Creating elemnts in JS 

// იმისთვის რომ შევქმნათ ელემენტი ამისთვის ვიყენებთ მეთოდს სახელად createElement('ელემენტი სახელი')

// მაგ:
let btn = document.createElement('button')




// adding elements in JS

// იმისთის რომ დავამატოთ ახალი ელემენტები ამისთვის ვიყენებთ მეთოდს element.appendChild('იმ ელემენტის სახელი რომლის დამატებაც გვინდა')

// მაგ:

// 1. ძებნის მშობელ ელემენტს
const list = document.getElementById('myList');

// 2. ქმნის მის შვილ ელემენტს
const newItem = document.createElement('li');
newItem.textContent = 'Bananas';

// 3. ამატებს ამ შვილი ელემენტის მნიშვნელობას მშობელ ელემნეტში 
list.appendChild(newItem);






// adding text in JS

// ტექსტის დასამატებელი კლასიკური გზაა createTextNode('ტექსტი რომელსაც ვამატებთ')

// ეს მეთოდი უბრალო ტექსტს აცქვს ობიქეტად რომ borwser-მა შეძლოს მისი დანახვა

// მაგ:

let p = document.createElement('p')
let Text = document.createTextNode('wassap')
p.appendChild(text)







// --------------------------------------------------------------------------------------------------------------------------------------------------




// Removing elemenst using JS

// იმისთვის რომ შვილი ელემენტი ამოვიღთ სიიდან ჯერ მის მშობელს უნდა მივწვდეთ და შემგედ გამოვიყენოთ მეთოდი removeChild()

// მაგ: 

let box = document.getElementById('container');
let bubblee = document.getElementById('bubble')
box.removeChild('bubble')




// იმისთვის რომ შევცვალოთ ელემენტუ ჩვენ გვჭირდება replaceChild() მეთოდი 

// ის იღებს ორ აგუმენტს:
// 1) ახალი node-ი რომლითაც უნდა შეცვალოდ
// 2) ძველი რ=node-ი რომელიც უნდა ჩანაცვლდეს 
// ისინი გამოყოფა მძიმით 






// --------------------------------------------------------------------------------------------------------------------------------------------------




// Event Listeners in JS - მოვლენის მსმნელები 


// მოვლენის მნსენელები გვეხმარებიან ჩვენი საიტი უფრო დინამიკური გახდეს. 
// სინტაქსში ჯერ იწერება მოვლენის სახელი ხოლო შემგდომ იწერება ის რაც ამ მოვლენის შემდეგ უნდა გაკეთდეს



// onclick = 'function();' --->  რამეზე დაკლიკებისას რომ მოხდება მოვლენა 

// mouseover = 'function();' -->  მოვლენა მაუსის გადატარებისას

// mouseout = 'function();' --> მაუსის მოშორებისას მომხდარი მოვლენა 




// addEventListener() ---> არის მეთოდი იმისთის რომ 


// დავამატოთ მოვლენის მშმენელები ჩვენს ელემენტებს უფრო მარტივი გზით.

// ის იღებს რო არგუმენტს:
// 1) მოვლენა რომელიც უნდა განხორციელდეს
// 2) ის ფუნქცია რომელიგ გაეშვება ამ მოვლენის შემდეგ ანუ callback function '



// რომ მოვაშოროთ ელემენტის მოვლენა ვიყენებთ მეთოდს removeEventListener();



// pointerdown ---> არის ისეთი რომვლენა რომელიც ხდება მოუსის ღილაკზე დაჭერისას

// pointerup ---> როდესაც ხელს ანდ მოუსს ავუშვებთ ელემენტიდან 








// --------------------------------------------------------------------------------------------------------------------------------------------------




// Events and Objects

// target  ---> მიზანი, როდესაც ჩვენ გვინდა რომ კონკრეტულ ემენეტს ჩავწვდეთ ჩვენ შეგვიძლია გამოვიყენოთ  .target მეთოდი 

// მაგ:

let answer = event.target.style.color;


// event --> ამ შემთხვევაში არის ის იბიქტი რომელში ინახება სტილი







// --------------------------------------------------------------------------------------------------------------------------------------------------




